{
    "Stoic_Twelve_Steps": [
        "We accept that we are no longer managing our lives as rational and social human beings.",
        "We came to understand that virtue: wisdom, self-discipline, justice, and courage, can transform our lives; to regain our sanity and our place in society.",
        "We have decided to work for continual progress, to act upon what is ours to change, and to accept what we cannot change.",
        "We have made a searching and honest assessment of our core beliefs, our values, and our goals.",
        "We admitted to ourselves and to another person the nature of the moral choices we have made in the past.",
        "We are entirely ready to work to improve our character, to examine our impulses, our judgments, and our intentions.",
        "We humbly accept that we must control our irrational motivations and our mistaken desires.",
        "We understand the social nature of humans, that we are all one family and that justice is the supreme virtue.",
        "We have attempted to reconcile ourselves with whoever we have been unjust, with the exception that in doing so would injure them or others.",
        "We continue to give continual scrutiny to our thoughts, emotions, and intentions and to apply good judgment in all our acts.",
        "We sought through conscious attention and meditation to improve our understanding of ourselves and our place in the world, wishing only to understand how we should act socially and rationally for the common good.",
        "Having undergone a personal transformation through these steps we will carry this message to others and to practice these principles in all our affairs."
    ],
    "second_tradition": "For our group purpose, there is but one ultimate authority - virtue itself: wisdom, self-discipline, justice, and courage. Our leaders are but trusted servants; they do not govern.",
    "source": "Stoic Recovery Adaptation.",
    "higher_power": "Virtue itself, encompassing wisdom, self-discipline, justice, and courage."
}