{
  "Humanist Twelve Steps": {
    "source": "Drafted by B. F. Skinner, 1972 Humanist of the Year Award Winner, researcher, and writer at Harvard University.",
    "steps": [
      "We accept the fact that all our efforts to stop drinking have failed.",
      "We believe that we must turn elsewhere for help.",
      "We turn to our fellow men and women, particularly those who have struggled with the same problem.",
      "We have made a list of the situations in which we are most likely to drink.",
      "We ask our friends to help us avoid those situations.",
      "We are ready to accept the help they give us.",
      "We honestly hope they will help.",
      "We have made a list of the persons we have harmed and to whom we hope to make amends.",
      "We shall do all we can to make amends, in any way that will not cause further harm.",
      "We will continue to make such lists and revise them as needed.",
      "We appreciate what our friends have done and are doing to help us.",
      "We, in turn, are ready to help others who may come to us in the same way."
    ],
    "second_tradition": "For our group purpose, there is but one ultimate authority - our shared human values and ethics. Our leaders are but trusted servants; they do not govern."
  },
  "Buddhist Non-Theist 12 Steps": {
    "source": "Created by Bodhi, from Sydney, Australia, published on the Realistic Recovery website.",
    "steps": [
      "We admitted our addictive craving over alcohol, and recognized its consequences in our lives.",
      "Came to believe that a power other than self could restore us to wholeness.",
      "Made a decision to go for refuge to this other power as we understood it.",
      "Made a searching and fearless moral inventory of ourselves.",
      "Admitted to ourselves and another human being the exact moral nature of our past.",
      "Became entirely ready to work at transforming ourselves.",
      "With the assistance of others and our own firm resolve, we transformed unskillful aspects of ourselves and cultivated positive ones.",
      "Made a list of all persons we had harmed.",
      "Made direct amends to such people where possible, except when to do so would injure them or others.",
      "Continued to maintain awareness of our actions and motives, and when we acted unskillfully promptly admitted it.",
      "Engaged through the practice of meditation to improve our conscious contact with our true selves, and seeking that beyond self.",
      "Having gained spiritual insight as a result of these steps, we practice these principles in all areas of our lives, and make this message available to others in need of recovery."
    ],
    "second_tradition": "For our group purpose, there is but one ultimate authority - the Tao, or the natural way of things. Our leaders are but trusted servants; they do not govern."
  },
  "Proactive Twelve Steps for Mindful Recovery": {
    "source": "The Proactive Twelve Steps for Mindful Recovery.",
    "steps": [
      "I get it. What I've been doing is self-destructive. I need to change.",
      "I see the big picture: The way to stop relapsing into self-destructive behaviors is to build a healthier sense of self.",
      "I have an action plan: From now on, I am squarely facing everything that is in the way of feeling satisfied with my life.",
      "I honestly look at the effects of my actions on others and myself.",
      "I take responsibility for my actions.",
      "I see that my knee-jerk reactions have to do with being in the grip of more or less conscious fears.",
      "I strive to find my motivation in a deeper sense of who I really am, rather than fear and defensiveness.",
      "I stop blaming and feeling blamed, with a willingness to heal the wounds.",
      "I swallow my pride, and sincerely apologize to people I've hurt, except when this would be counterproductive.",
      "I live mindfully, paying attention to the motives and effects of my actions.",
      "I stay in touch with a broader sense of who I really am, and a deeper sense of what I really want.",
      "A growing sense of wholeness and contentment motivates me to keep at it, and to share this process with others who are struggling."
    ],
    "second_tradition": "For our group purpose, there is but one ultimate authority - evidence and reason. Our leaders are but trusted servants; they do not govern."
  },
  "Secular Steps for Addiction Recovery": {
    "source": "Twelve Secular Steps: An Addiction Recovery Guide by Bill W., published in 2018.",
    "steps": [
      "I admitted that I am an addict (alcoholic), and that my life had become unmanageable.",
      "Came to believe that through honesty and effort, combined with the help of others, I could recover from addiction.",
      "Made a decision to actively work a Twelve Step recovery plan to the best of my ability.",
      "Completed a searching and fearless moral inventory of myself.",
      "Honestly admitted to myself and to another human being the results of my inventory, including my defects of character.",
      "Became willing to change defects in my character.",
      "Accepted responsibility for my actions.",
      "Listed all persons I had harmed, and became willing to make amends to them all.",
      "Made direct amends to such people wherever possible, except when to do so would injure them or others.",
      "Continued to take personal inventory, and when I was wrong, promptly admitted it.",
      "Sought to improve my conscious awareness of ethical principles and values, and to use them consistently as standards for my decisions and actions.",
      "Having matured as a person as a result of these Steps, I acknowledge my commitment to help others and to continue to use these principles in my daily life."
    ],
    "second_tradition": "For our group purpose, there is but one ultimate authority - the group conscience. Our leaders are but trusted servants; they do not govern."
  },
  "Native American 12 Steps": {
    "source": "Prepared by the Umatilla Tribal Alcohol Program.",
    "steps": [
      "We admitted we were powerless over alcohol, that we had lost control of our lives.",
      "We came to believe that a power greater than ourselves could help us regain control.",
      "We made a decision to ask for help from a Higher Power and others who understand.",
      "We stopped and thought about our strengths and our weaknesses and thought about ourselves.",
      "We admitted to the Great Spirit, to ourselves and to another person the things we thought were wrong about ourselves.",
      "We are ready, with the help of the Great Spirit, to change.",
      "We humbly ask a Higher Power and our friends to help us change.",
      "We made a list of people who were hurt by our drinking, and want to make up for these hurts.",
      "We are making up to those people whenever we can, except when to do so would hurt them more.",
      "We continue to think about our strengths and weaknesses, and when we are wrong we say we are wrong.",
      "We pray and think about ourselves, praying only for strength to do what is right.",
      "We try to help other alcoholics and to practice these principles in everything we do."
    ],
    "second_tradition": "For our group purpose, there is but one ultimate authority - the wisdom of the Earth and the traditions of our ancestors. Our leaders are but trusted servants; they do not govern."
  },
  "A Freethinker's Steps": {
    "source": "John L., published on AA Agnostica, February 2010.",
    "steps": [
      "We admitted that we were alcoholics - that we suffered from an addiction which is invariably fatal unless arrested.",
      "We hoped for recovery from our addiction.",
      "We committed ourselves to lifelong abstinence, staying away from the first drink, a day at a time.",
      "We joined a fellowship of recovering alcoholics, who help each other maintain sobriety.",
      "We honestly evaluated our lives, acknowledging both our strengths and our weaknesses.",
      "We did our best to build on our strengths and to overcome our weaknesses.",
      "We got our lives in order - dealt with the wreckage of the past - made amends whenever feasible.",
      "We strived to be in good health: We stopped smoking, exercised, got enough rest, and ate nutritious food.",
      "We determined to live in the real world, here and now, whether pleasant or painful. We pledged allegiance to reason and evidence, rather than superstition and dogma.",
      "We abstained from mind-altering drugs, including those prescribed by physicians.",
      "We continued to share our experience, strength and hope with other recovering alcoholics.",
      "We carried the message of sobriety to alcoholics who were still drinking."
    ],
    "second_tradition": "For our group purpose, there is but one ultimate authority - the pursuit of truth, wherever it may lead. Our leaders are but trusted servants; they do not govern."
  },
  "Stoic 12 Steps": {
    "source": "https://stoicrecovery.com/2018/02/04/12-stoic-steps/",
    "steps": [
      "We accept that we are no longer managing our lives as rational and social human beings.",
      "We came to understand that virtue: wisdom, self-discipline, justice, and courage, can transform our lives; to regain our sanity and our place in society.",
      "We have decided to work for continual progress, to act upon what is ours to change, and to accept what we cannot change.",
      "We have made a searching and honest assessment of our core beliefs, our values, and our goals.",
      "We admitted to ourselves and to another person the nature of the moral choices we have made in the past.",
      "We are entirely ready to work to improve our character, to examine our impulses, our judgments, and our intentions.",
      "We humbly accept that we must control our irrational motivations and our mistaken desires.",
      "We understand the social nature of humans, that we are all one family and that justice is the supreme virtue.",
      "We have attempted to reconcile ourselves with whoever we have been unjust, with the exception that in doing so would injure them or others.",
      "We continue to give continual scrutiny to our thoughts, emotions, and intentions and to apply good judgment in all our acts.",
      "We sought through conscious attention and meditation to improve our understanding of ourselves and our place in the world, wishing only to understand how we should act socially and rationally for the common good.",
      "Having undergone a personal transformation through these steps we will carry this message to others and to practice these principles in all our affairs."
    ],
    "second_tradition": "For our group purpose, there is but one ultimate authority - evidence and reason. Our leaders are but trusted servants; they do not govern."
  },
  "Islamic 12 Steps to Recovery": {
    "source": "Millati Islami groups, founded in Baltimore, 1989.",
    "steps": [
      "We admitted that we were neglectful of our higher selves and that our lives have become unmanageable.",
      "We came to believe that Allah could and would restore us to sanity.",
      "We made a decision to submit our will to the will of Allah.",
      "We made a searching and fearless moral inventory of ourselves.",
      "We admitted to Allah and to ourselves the exact nature of our wrongs.",
      "Asking Allah for right guidance, we became willing and open for change, ready to have Allah remove our defects of character.",
      "We humbly ask Allah to remove our shortcomings.",
      "We made a list of persons we have harmed and became willing to make amends to them all.",
      "We made direct amends to such people wherever possible, except when to do so would injure them or others.",
      "We continued to take personal inventory and when we were wrong promptly admitted it.",
      "We sought through Salaat (prayer service) and Iqraa (reading and studying) to improve our understanding of Taqwa (God consciousness; proper Love and respect for Allah) and Ihsan (though we cannot see Allah, he can see us).",
      "Having increased our level of Iman (faith) and Taqua, as a result of applying these steps, we carried this message to humanity and began practicing these principles in all our affairs."
    ],
    "second_tradition": "For our group purpose, there is but one ultimate authority - the teachings and will of Allah. Our leaders are but trusted servants; they do not govern."
  }
}

